## Correlation quiz

In [1]:
import numpy as np
import pandas as pd

In [3]:
data = pd.read_csv('./illiteracy.txt', sep='\t')
data.head()

   Country  Illit  Births
0  Albania   20.5    1.78
1  Algeria   39.1    2.44
2  Bahrain   15.0    2.34
3   Belize    5.9    2.97
4    Benin   73.5    5.60

In [6]:
new_data = data.drop('Country', axis=1)

In [7]:
new_data.head()

   Illit  Births
0   20.5    1.78
1   39.1    2.44
2   15.0    2.34
3    5.9    2.97
4   73.5    5.60

In [8]:
new_data.corr()

           Illit    Births
Illit   1.000000  0.768663
Births  0.768663  1.000000

In [9]:
new_data.corr(method='spearman')

           Illit    Births
Illit   1.000000  0.752962
Births  0.752962  1.000000